abstract final class SurveyMaps {
  static const Map<int, String> homeType = {
    1: 'кўп қаватли уй',
    2: 'якка тартибдаги турар жой (ҳовли)',
    3: 'оилавий ётоқхона',
    4: 'дала ҳовли (дача)',
    5: 'нотурар бино',
  };

  static const Map<int, String> interview = {
    1: 'суҳбат ўтказилди',
    2: 'суҳбат ўтказишнинг иложи бўлмади',
  };

  static const Map<int, String> interviewNeighbors = {
    1: 'бошқа ҳудудга(вилоятга) доимий кўчиб ўтганлиги айтилди',
    2: 'ҳозирда чет елда бўлганлиги сабабли ҳеч ким йўқ',
    3: 'хонадон егалари кечгача ишлаганлиги сабабли тунги вақтда уйда бўлишади',
    4: 'ушбу хонадонда яшовчилар тўғрисида қўшнилар маълумотга ега емас',
    5: 'егасиз бўш турган уй',
    6: 'бошқа сабаб',
  };

  static const Map<int, String> neighborsPhone = {
    1: 'ҳа',
    2: 'йўқ',
  };

  static const Map<int, String> ownership = {
    1: 'шахсий',
    2: 'ижара',
  };

  static const Map<int, String> singlePerson = {
    1: 'ҳа',
    2: 'йўқ',
  };

  static const Map<int, String> docType = {
    1: 'фуқаролик паспорт / ID карта',
    2: 'туғилганлик ҳақида гувоҳнома',
  };

  static const Map<int, String> relationship = {
    1: 'Отаси',
    2: 'Онаси',
    3: 'Опаси',
    4: 'Aкаси',
    5: 'Синглиси',
    6: 'Укаси',
    7: 'Турмуш ўртоғи',
    8: 'Қизи',
    9: 'Ўғли',
    10: 'Қайнотаси',
    11: 'Қайнонаси',
    12: 'Келини',
    13: 'Бошқа',
    14: 'Куёви',
    15: 'Набира',
    16: 'Хонадон егаси',
    17: 'Ижарачи',
  };

  static const Map<int, String> diseaseTypes = {
    1: 'Бош мия касаллиги',
    2: 'Юрак-қон томирлар касаллиги',
    3: 'Буйрак ва пешоб касаллиги',
    4: 'Асаб-руҳий тизим касаллиги',
    5: 'Ошқозон ичак тизими касаллиги',
    6: 'Нафас аъзолари касаллиги',
    7: 'Эндокрин безлар касаллиги',
    8: 'Онкологик касаллик',
    9: 'Суяк тизими касаллиги',
    10: 'Мушак тизими касаллиги',
    11: 'Бўғим касаллиги',
    12: 'Қон тизими касаллиги',
    13: 'Сил касаллиги',
    14: 'Бошқа касаллик',
  };

  static const Map<int, String> disabilityGroup = {
    1: '1-гуруҳ',
    2: '2-гуруҳ',
    3: '3-гуруҳ',
    4: 'ногиронлик гуруҳу йўқ',
  };

  static const Map<int, String> disabilityType = {
    1: 'туғма',
    2: 'орттирилган',
  };
}
